[{
        "name": "Jerry Ambe(cousin)",
        "description": "Auntie is our center of attention at the moment but we would like to take a moment to thank you Sister Jackie for everything.The sacrifices, the late nights, the care and love towards our beloved Auntie, You gave auntie reasons to live much longer . You showered, cloth, feed and cleaned after her. You did all this things happily. With a greatful heart we want to say thanks you so much We have no doubt auntie is looking down from heaven at this moment with a smile on her face❤ towards you.It was a great time with you and auntie at the hospital.You did the most you could but God know best.Your Cousin Jerry.",
        "image_source": "/static/assets/img/post-bg.jpg",
        "url": "jerry-ambe"
    },

    {
        "name": "Evelyn Ambe",
        "description": "Mmmm….🤔 another story.. Aunty you always made sure we were proper, kept nice short hair do’ s and no makeup.You told us to focus on our studies.You said all that“ nianga” translation“ makeup” was a distraction to attract boys. I remember one fine summer holiday around age 14 yrs.I was all dressed up makeup and all ready to sneak out to meet with friends.“Yes sneak out”.Back in the days you sometimes had to do just that because, permission was not always granted.Mind you this was in bright day light if you know what I mean. Aunty you saw me about to sneak out; oops“ busted!”.I remembered you called out“ Moneh”.A nickname you seldom use only in times that signifies trouble! You asked where I thought I was going and one look at me with makeup on you told me I was going nowhere. Lessons learnt, I never asked for permission which I recognized was wrong.And on top of that You made me clean up my makeup.Can you imagine bubbles busted, heart racing knowing I was not going to hang out with friends..imagine the feelings. Moral to the story, despite my uncharacteristic truancy aunty that spirit in you of understanding and guidance you allowed me to still meetup with my friends.You highlighted what I did wrong, and made me apologize for my poor choice action. You could have grounded me but you did not.You knew I would be heartbroken after a well planned rendezvous with friends.Your approach to problem solving taught me a better lesson on how to approach similar situations the future. Aunty, till this day, I emulate that practice with my kids Ambe and Azinwi; that spirit of understanding, guidance and tough love💕 Love you forever Aunty💕 Continue to rest well.",
        "image_source": "/static/assets/img/home-bg.jpg",
        "url": "evelyn-ambe"
    },
    {
        "name": "Irene Ambe",
        "description": "Indeed Fide, it’s not only her generosity. This is a woman who bear no animosity in heart for anyone doesn’t matter who. If you had not called her for years, gave her nothing , or recognize and appreciate anything about her, she would not carry anger, vex, hatred or any sort of defiance against you. When she hears your long lost voice she brings you joy, take away your own guilt of abandonment. There’s been many times life took me away from her not being in touch regularly and when I did call she will scream with joy “madam irene ambe bi Nguni” addressing all known names. She inquired about the children, my husband and everyone. As we live this life we are not perfect but one thing for sure is our personal relationship with man and God which I know If I were to grade her I will give her A+ pass. I pray everyday honestly to emulate this woman for the kind of heart she has - bearing no grievances, forgiving, and accepting people as they are and make the best out of them. Aunty I have learnt, took things for granted but promised to be a better person.",
        "image_source": "/static/assets/img/about-bg.jpg",
        "url": "irene-ambe"
    },
    {
        "name": "Munifor Larry S. Ambe (Nephew-in-Law).",
        "description": "Aunty Therese, You were a Blessing and Matriarch of the family God created through your image, deeds, examples and Faith. You meant so much to so many... and exemplified many of God's virtues - humility, kindness, love, generosity, brilliance and a fervent devotion to the Gospel.  Many a night, you spent in deep communion with Thee and many a day, you lived in intimate remembrance of Thee. Your mission in this fleeting world is over and you earned your rest and evolution to the next life. May your gentle soul continue to progress in God's Eternal Kingdom. And may God grant your children: Protus, Geraldine, Nicholine and Beltus, family, friends, colleagues and well wishers the fortitude to accept His Will.  The Memories you shared and God's Benedictions to you in this transient world will live on...",
        "image_source": "/static/assets/img/contact-bg.jpg",
        "url": "larry-ambe"
    },
    {
        "name": "Ephraim Abam",
        "description": "Auntie, wishing you a peaceful rest in the bosom of our Creator. May your spirit remain with us until meet again. You will forever be missed. Adios auntie.",
        "image_source": "/static/assets/img/post-bg.jpg",
        "url": "ephraim-ambe"
    },
    {
        "name": "Walters Akonwah (nephew)",
        "description": "Auntie… Please May the Lord take you into his bosom and grant you external rest until we meet again. May your gentle soul RIP…",
        "image_source": "/static/assets/img/post-bg.jpg",
        "url": "walters-ambe"
    },
    {
        "name": "Pandora Ambe-Abam (niece) ",
        "description": "My dear family, as you mourn and celebrate Our Matriach, I share with you this song that speaks to and has always spoken to me. It is called Healing Rain by Michael W. Smith. It is a beautiful song that makes you cry and smile at the same time… may you all be blessed always.",
        "image_source": "/static/assets/img/post-bg.jpg",
        "url": "pandora-ambe"
    },
    {
        "name": "Peter Kome ",
        "description": "ALTHOUGH IN FLESH YOU APPEAR DEAD, IN SPIRIT YOU ARE STILL ALIVE IN ALL OF US, ESPECIALLY IN ALL YOUR SISTERS, DAUGHTERS AND GRANDDAUGHTERS, TO ALL OF WHOM ON YOUR BEHALF I WISH TO SAY: HAPPY WOMEN 'S DAY AND CONGRATULATION TO EACH AND EVERYONE OF YOU ESTEEMED LADIES IN THE STORY AND LIVE OF MADAM THERESA SIRRI AMBE.  YOUR MENTOR AND INSPIRATIRATOR WAS ONE OF THE MOST OUTSTANDING LADIES IN THIS WORLD. Mama you always asked us to pray and every morning I rang our little bell and you knelt with us in prayers in our little parlor in Cassava Farms Victoria / Limbe. You said Christians don 't die. So we believe you continue to live although now in spirit within each of us your numerous children and loved ones. May God grant you rest. We love and we miss you dearly.",
        "image_source": "/static/assets/img/post-bg.jpg",
        "url": "peter-ambe"
    },
    {
        "name": "Dr Irene Wakam",
        "description": "Her job on earth is over.I remember her smile and loving spirit.I very much admired her forgiving spirit.May her soul RIP I hope we will all make her proud by coming together to honor her ",
        "image_source": "/static/assets/img/post-bg.jpg",
        "url": "irenewakam-ambe"
    },
    {
        "name": "TangieNeba Ngwa-Su",
        "description": "Evy can we gather as many of these pictures as possible of aunty to make an album for loving, remembrance & great memory? A r keep sake recons of aunty is these way to have forever record of an illustrious family member like aunty Therese. Let us try to gather pictures that can be in an album for all of us. I may be able to dig up one or more from my achive to share too.NNS",
        "image_source": "/static/assets/img/post-bg.jpg",
        "url": "tangieneba-ambe"
    },
    {
        "name": "Honoria Ambe",
        "description": "Ohhh such Beautiful pictures I always saw you with this beautiful smile. Never a day i saw you sad. I wish i could sing for you again as you've always wanted. That accountant you and daddy Philip fought for. It's just under a week i got to be your Accountant. unfortunately you were so weak to talk to me. Besides my mom, you were the closest i had. This hit hard. God I cannot hold my tears. Go well sweet mother. You've left a big hole in our hearts. We love you so much. The heavenly family just welcomed a saint. Fare you well aunty Te. Greet my daddy, uncle Paul, Rev Suh and all those who have gone before us, till we meet to part no more.",
        "image_source": "/static/assets/img/post-bg.jpg",
        "url": "honoria-ambe"
    },
    {
        "name": "Maureen Ambe",
        "description": "I know my Aunt is in heaven, may u rest well in the arms of the Lord. We will deeply miss u . U made my childhood better with ur decipline and ur love. I spoke to u on a regular basis and on Saturday night I lastly called wanting to hear that beautiful voice was told u are week and couldn't speak, I knew it really wasn't getting better. I received 4 missed called from my phone, when later saw it, my heart beat and I spoke to my self let this not be true. That same dayin the morning I got up at 5 am went to the toilet a cat came right close to me and cried 3 good times I look for a stone and shot it away. When them I was called Auntie died that same 5 15 am..",
        "image_source": "/static/assets/img/post-bg.jpg",
        "url": "maureen-ambe"
    },
    {
        "name": "Fidelis Ambe(nephew)",
        "description": "Yesterday I was remembering my lovely sweet Auntie T and the story of the book of Act 9:36-42, about Dorcas or Tabitha came into my thoughts. It dawned to me that all this years I or we lived with Dorcas. Auntie Therry was our Dorcas, who gave it all to everyone who came across her. He generosity new no limits. Our Dorcas is gone, it is time for us to come out to bear testimony of her goodness. Let the people know that Dorcas (Auntie therry) was our Mother, auntie, grand mother, sister, etc. Like the community of Lydda testified of the good works and acts of charity to the apostles, let the world know that you did encounter Dorcas in your life.Let the praises of her good deeds from your mouths go with her.Auntie T you are a role model of generosity, unconditional love and goodness.RIP.  Auntie Therry even though you were the 5 in the line and last but 1 amongst your siblings your deliberately made sure you invested your resources in to every household of your siblings and your extended cousins from the oldest to the youngest of them all.You believed that you had more to give than any other person.Auntie I cannot remember any moment since from about 1972 when I can remember that I came to your home and there were less that 5 persons and even up to 10 or more leaving with you, and you provided for them with joy.From new born babies to men and women in their 30 s.We always looked forward to come to your home.Even when you had only 2 bedroom, there was always space for everyone.None of us could ever pass by your city without stopping by.How was it possible that you could feed all those mouth so joyfully ? Your home was a true miracle of the multiplication of 5 loaves and 2 fishes to feed thousands.You are forever in our.RIP.",
        "image_source": "/static/assets/img/post-bg.jpg",
        "url": "fidelis-ambe"
    }
]